tap "filosottile/musl-cross"
tap "go-swagger/go-swagger"
tap "homebrew/cask"
tap "jesseduffield/lazygit"
tap "mac-cleanup/mac-cleanup-py"
tap "nats-io/nats-tools"
tap "nikitabobko/tap"
brew "cmake"
brew "curl"
brew "eza"
brew "fd"
brew "gnutls"
brew "ffmpeg"
brew "fzf"
brew "gcc"
brew "gci"
brew "git"
brew "gnu-sed"
brew "pinentry"
brew "gnupg"
brew "go"
brew "gofumpt"
brew "golangci-lint"
brew "golangci-lint-langserver"
brew "golines"
brew "goose"
brew "gopls"
brew "gradle"
brew "graphviz"
brew "grep"
brew "hl"
brew "ncurses"
brew "htop"
brew "jq"
brew "kotlin"
brew "lazygit"
brew "libpq"
brew "lua-language-server"
brew "mas"
brew "neovim"
brew "node"
brew "pgformatter"
brew "pkgconf"
brew "podman"
brew "podman-compose"
brew "poetry"
brew "protobuf"
brew "pyenv"
brew "pygments"
brew "python@3.10"
brew "ripgrep"
brew "rustup"
brew "stylua"
brew "tmux"
brew "tree"
brew "wget"
brew "yq"
brew "yt-dlp"
brew "zoxide"
brew "filosottile/musl-cross/musl-cross"
brew "go-swagger/go-swagger/go-swagger"
brew "mac-cleanup/mac-cleanup-py/mac-cleanup-py"
cask "aerospace"
cask "alacritty"
cask "aldente"
cask "anydesk"
cask "blackhole-16ch"
cask "charles"
cask "claude-code"
cask "dbeaver-community"
cask "discord"
cask "firefox"
cask "firefox@nightly"
cask "font-blex-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "ghostty"
cask "google-chrome"
cask "google-drive"
cask "gpg-suite"
cask "hhkb"
cask "iina"
cask "insomnia"
cask "keepassxc"
cask "keyboardcleantool"
cask "obs"
cask "obsidian"
cask "postman"
cask "rar"
cask "slack"
cask "stats"
cask "steam"
cask "telegram-desktop"
cask "thunderbird"
cask "transmission"
cask "visual-studio-code"
cask "zed"
cask "zoom"
mas "Karing", id: 6472431552
mas "Outline", id: 1356178125
mas "WhatsApp", id: 310633997
mas "Windows App", id: 1295203466
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835
vscode "golang.go"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode.vscode-typescript-next"
vscode "peterj.proto"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
