tap "filosottile/musl-cross"
tap "go-swagger/go-swagger"
tap "homebrew/cask"
tap "jesseduffield/lazygit"
tap "mac-cleanup/mac-cleanup-py"
tap "nats-io/nats-tools"
tap "nikitabobko/tap"
brew "black"
brew "cmake"
brew "curl"
brew "eza"
brew "fd"
brew "gnutls"
brew "ffmpeg"
brew "fzf"
brew "gcc"
brew "gci"
brew "git"
brew "gnu-sed"
brew "pinentry"
brew "gnupg"
brew "go"
brew "gofumpt"
brew "golangci-lint"
brew "golangci-lint-langserver"
brew "golines"
brew "goose"
brew "gopls"
brew "gradle"
brew "graphviz"
brew "grep"
brew "hl"
brew "ncurses"
brew "htop"
brew "isort"
brew "jq"
brew "kotlin"
brew "lazygit"
brew "libpq"
brew "lua-language-server"
brew "mac-cleanup-py"
brew "mas"
brew "neovim"
brew "node"
brew "pgformatter"
brew "pkgconf"
brew "podman"
brew "podman-compose"
brew "protobuf"
brew "pyenv"
brew "pygments"
brew "pyright"
brew "python@3.10"
brew "radare2"
brew "ripgrep"
brew "rustup"
brew "stylua"
brew "tmux"
brew "tree"
brew "uv"
brew "wget"
brew "yamlfix"
brew "yq"
brew "yt-dlp"
brew "zoxide"
brew "filosottile/musl-cross/musl-cross"
brew "go-swagger/go-swagger/go-swagger"
cask "aerospace"
cask "aldente"
cask "blackhole-16ch"
cask "charles"
cask "clash-verge-rev"
cask "claude-code"
cask "dbeaver-community"
cask "discord"
cask "firefox"
cask "firefox@nightly"
cask "font-blex-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "ghostty"
cask "google-chrome"
cask "google-drive"
cask "gpg-suite"
cask "hhkb"
cask "iina"
cask "insomnia"
cask "keepassxc"
cask "keyboardcleantool"
cask "localsend"
cask "obs"
cask "obsidian"
cask "postman"
cask "rar"
cask "slack"
cask "stats"
cask "steam"
cask "telegram-desktop"
cask "thunderbird"
cask "transmission"
cask "utm"
cask "visual-studio-code"
cask "zed"
cask "zoom"
mas "Happ", id: 6746188973
mas "Karing", id: 6472431552
mas "WhatsApp", id: 310633997
mas "Windows App", id: 1295203466
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835
vscode "golang.go"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode.vscode-typescript-next"
vscode "peterj.proto"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
go "github.com/klauspost/asmfmt/cmd/asmfmt"
go "golang.org/x/tools/cmd/callgraph"
go "github.com/go-delve/delve/cmd/dlv"
go "github.com/kisielk/errcheck"
go "github.com/davidrjenni/reftools/cmd/fillstruct"
go "github.com/davidrjenni/reftools/cmd/fillswitch"
go "github.com/momaek/formattag"
go "github.com/onsi/ginkgo/v2/ginkgo"
go "github.com/abice/go-enum"
go "github.com/OJ/gobuster/v3"
go "github.com/rogpeppe/godef"
go "mvdan.cc/gofumpt"
go "golang.org/x/tools/cmd/goimports"
go "github.com/fatih/gomodifytags"
go "github.com/abenz1267/gomvp"
go "github.com/pressly/goose/v3/cmd/goose"
go "golang.org/x/tools/gopls"
go "golang.org/x/tools/cmd/gorename"
go "github.com/jstemmer/gotags"
go "github.com/cweill/gotests/gotests"
go "gotest.tools/gotestsum"
go "golang.org/x/vuln/cmd/govulncheck"
go "golang.org/x/tools/cmd/guru"
go "github.com/koron/iferr"
go "github.com/josharian/impl"
go "github.com/tmc/json-to-struct"
go "honnef.co/go/tools/cmd/keyify"
go "go.uber.org/mock/mockgen"
go "github.com/fatih/motion"
go "github.com/ogen-go/ogen/cmd/ogen"
go "google.golang.org/open2opaque"
go "github.com/michurin/human-readable-json-logging/cmd/pplog"
go "connectrpc.com/connect/cmd/protoc-gen-connect-go"
go "google.golang.org/protobuf/cmd/protoc-gen-go"
go "google.golang.org/grpc/cmd/protoc-gen-go-grpc"
go "github.com/twitchtv/twirp/protoc-gen-twirp"
go "github.com/go-bridget/twirp-swagger-gen/cmd/protoc-gen-twirp-swagger"
go "github.com/envoyproxy/protoc-gen-validate"
go "github.com/mgechev/revive"
go "github.com/kyoh86/richgo"
go "honnef.co/go/tools/cmd/staticcheck"
go "github.com/go-bridget/twirp-swagger-gen/cmd/twirp-swagger-gen"
