tap "anomalyco/tap", trusted: true
tap "cesarferreira/tap", trusted: true
tap "go-swagger/go-swagger", trusted: true
tap "jesseduffield/lazygit", trusted: true
tap "mac-cleanup/mac-cleanup-py", trusted: true
tap "nikitabobko/tap", trusted: true
# Download with resuming and segmented downloading
brew "aria2"
# Improved shell history for zsh, bash, fish and nushell
brew "atuin"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Language Server for Bash
brew "bash-language-server"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Bash beautifier
brew "beautysh"
# Python code formatter
brew "black"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# New way of working with Protocol Buffers
brew "buf"
# JSON Schema CLI
brew "check-jsonschema"
# Cross-platform make
brew "cmake"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Debugger for the Go programming language
brew "delve"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# Control Golang package import order and make it always deterministic
brew "gci"
# Independent set of GDScript tools - parser, linter, formatter, and more
brew "gdtoolkit"
# Distributed revision control system
brew "git"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Passphrase entry dialog utilizing the Assuan protocol
brew "pinentry"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Fast linters runner for Go
brew "golangci-lint"
# GNU grep, egrep and fgrep
brew "grep"
# Fast and powerful log viewer and processor
brew "hl"
# Sort Python imports automatically
brew "isort"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Simple terminal UI for git commands
brew "lazygit"
# Postgres C API library
brew "libpq"
# Language Server for the Lua language
brew "lua-language-server"
# Python cleanup script for macOS
brew "mac-cleanup-py"
# GUI for vim, made for macOS
brew "macvim"
# Language Server Protocol for Markdown
brew "marksman"
# Mac App Store command-line interface
brew "mas"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Media player based on MPlayer and mplayer2
brew "mpv"
# Text-based UI library
brew "ncurses"
# Incremental parsing library
brew "tree-sitter"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim", args: ["HEAD"]
# PostgreSQL syntax beautifier
brew "pgformatter"
# Tool for managing OCI containers and pods
brew "podman"
# Alternative to docker-compose using podman
brew "podman-compose"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Go support for Google's protocol buffers
brew "protoc-gen-go"
# Python version management
brew "pyenv"
# Static type checker for Python
brew "pyright"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# CLI proxy to minimize LLM token consumption
brew "rtk"
# Experimental Rust compiler front-end for IDEs
brew "rust-analyzer"
# Rust toolchain installer
brew "rustup"
# Shell Script Compiler
brew "shc"
# Cross-shell prompt for astronauts
brew "starship"
# Opinionated Lua code formatter
brew "stylua"
# TOML toolkit written in Rust
brew "taplo"
# User interface to the TELNET protocol
brew "telnet"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Parser generator tool
brew "tree-sitter-cli"
# Language Server Protocol implementation for TypeScript wrapping tsserver
brew "typescript-language-server"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Internet file retriever
brew "wget"
# Simple and configurable YAML formatter that keeps comments
brew "yamlfix"
# Extensible command-line tool to format YAML files
brew "yamlfmt"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fuzzy find and kill processes from your terminal
brew "cesarferreira/tap/rip"
# Toolkit to work with swagger for golang
brew "go-swagger/go-swagger/go-swagger"
# AeroSpace is an i3-like tiling window manager for macOS
cask "nikitabobko/tap/aerospace"
# GPU-accelerated terminal emulator
cask "alacritty"
# Menu bar tool to limit maximum charging percentage
cask "aldente"
# Terminal-based AI coding assistant
cask "claude-code"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# Tool to run Windows software
cask "crossover"
# Databases and SQL IDE
cask "datagrip"
# Voice and text chat software
cask "discord"
# Developer platform
cask "dotnet-sdk"
# Web browser
cask "firefox"
cask "font-blex-mono-nerd-font"
# 2D and 3D game engine
cask "godot"
# C# scripting capable version of Godot game engine
cask "godot-mono"
# Web browser
cask "google-chrome"
# Client for the Google Drive storage service
cask "google-drive"
# Tools to protect your emails and files
cask "gpg-suite"
# Open Source Multimedia Framework
cask "gstreamer-runtime"
# Deck tracker and deck manager for Hearthstone
cask "hstracker"
# Free and open-source media player
cask "iina"
# HTTP and GraphQL Client
cask "insomnia"
# Password manager app
cask "keepassxc"
# Blocks all Keyboard and TouchBar input
cask "keyboardcleantool"
# Full TeX Live distribution without GUI applications
cask "mactex-no-gui"
# Open-source software for live streaming and screen recording
cask "obs"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Collaboration platform for API development
cask "postman"
# HTTP debugging proxy
cask "proxyman"
# Archive manager for data compression and backups
cask "rar"
# PDF reader and note-taking application
cask "skim"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Video game digital distribution service
cask "steam"
# Desktop client for Telegram messenger
cask "telegram-desktop"
# Customizable email client
cask "thunderbird"
# Open-source BitTorrent client
cask "transmission"
# Compatibility layer to run Windows applications
cask "wine@staging"
mas "Happ", id: 6746188973
mas "WireGuard", id: 1451685025
go "github.com/air-verse/air"
go "mvdan.cc/gofumpt"
go "golang.org/x/tools/cmd/goimports"
go "github.com/nametake/golangci-lint-langserver"
go "github.com/golangci/golines"
go "github.com/fatih/gomodifytags"
go "github.com/pressly/goose/v3/cmd/goose"
go "golang.org/x/tools/gopls"
go "github.com/cweill/gotests/gotests"
go "github.com/koron/iferr"
go "github.com/josharian/impl"
go "olexsmir.xyz/json2go/cmd/json2go"
go "go.uber.org/mock/mockgen"
